---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType
source: html/e18708e5-0036-d48b-dce4-9efcc840d6be.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType

Energy analysis opening type.

## Syntax (C#)
```csharp
public enum EnergyAnalysisOpeningType
```